from lesson02.geckodriver import driver


# Теория (https://youtu.be/-l6XqQp5y1A?si=HYRFSuTv4r4_owlL)
# / прямой потомок (только дочерние элементы первой степени) (сын)
# так-же поиск c / обязательно должен начинаться с объекта <html> -> /html/...
# // потомок любой степени (исключая родительские) (сын, внук, правнук, ...)

# =============================================================================
# INDEXATION
# =============================================================================
# //element//element[0]//element
# (//element//element)[0]
# =============================================================================

# =============================================================================
# ATTRIBUTE
# =============================================================================
# //element[@attribute="value"]
#     - <element attribute="value">
# -----------------------------------------------------------------------------
# //element[@attribute1="value1" and @attribute2="value2"]
#     - <element attribute1="value1" attribute2="value2">
# =============================================================================

# =============================================================================
# TEXT
# =============================================================================
# //element[text()="text"]
#     - <element>text</element>
# =============================================================================

# =============================================================================
# CONTAINS
# =============================================================================
# //element[contains(@attribute, "value2 value1")]
#     - <element attribute="value2 value1">
#     - <element attribute="... value2 ... value1 ...">
# -----------------------------------------------------------------------------
# //element[contains(@attribute1, "value1 value2") and contains(@attribute2, "value3")]
#     - <element attribute1="... value2 ... value1 ..." attribute2="... value3 ..."
# -----------------------------------------------------------------------------
# //element[contains(text(), "hello")]
#     - <element>hello world</element>
#     - <element>...hello...</element>
# =============================================================================

driver.get('http://books.toscrape.com/index.html')

# Добраться до кнопки

# /html/body/div/div/div/div/section/div[2]/ol/li/article
# /div[@class="product_price"]/form/button
button = driver.find_element(
    'xpath',
    (
        '/html/body/div/div/div/div/section/div[2]/ol/li'
        '/article/div[@class="product_price"]/form/button'
    ),
)
print(button.text)

# //button[text()="Add to basket"] (можно было просто //button)
button = driver.find_element('xpath', '//button[text()="Add to basket"]')
print(button.text)

# Огромный минус использования / кроме того, что получаются километровые пути,
# в том, что оно жестко привязано к прописанному местоположению и любое
# минимальное изменение структуры DOMа сломает ВСЕ!!!

# Конечно и способ // возможно поломать например если переименовать название
# кнопки (её текст), но такой способ нахождения элемента привязан не так жестко
# и нет риска что при небольшом изменении структуры HTML программа сломается.
